-- phpMyAdmin SQL Dump
-- version 2.11.11.3
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Мар 19 2013 г., 15:02
-- Версия сервера: 5.0.26
-- Версия PHP: 5.2.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

--
-- База данных: `auctionru_ruse`
--

-- --------------------------------------------------------

--
-- Структура таблицы `auc13_geodesic_categories`
--

CREATE TABLE IF NOT EXISTS `auc13_geodesic_categories` (
  `category_id` int(4) NOT NULL auto_increment,
  `parent_id` int(4) default NULL,
  `category_name` tinytext,
  `description` tinytext,
  `display_order` int(11) default NULL,
  `category_image` tinytext NOT NULL,
  `category_count` int(11) NOT NULL default '0',
  `auction_category_count` int(11) NOT NULL default '0',
  `in_statement` mediumtext NOT NULL,
  `what_fields_to_use` enum('site','parent','own') NOT NULL default 'parent',
  `display_ad_description_where` int(11) NOT NULL default '0',
  `display_all_of_description` int(11) NOT NULL default '0',
  `length_of_description` int(11) NOT NULL default '0',
  `use_buy_now` int(11) NOT NULL default '0',
  `editable_bid_start_time_field` int(11) NOT NULL default '0',
  `default_display_order_while_browsing_category` int(11) NOT NULL default '0',
  `listing_types_allowed` int(11) NOT NULL default '0',
  `display_storefront_link` int(11) NOT NULL default '0',
  `use_auto_title` tinyint(1) NOT NULL default '0',
  `auto_title` varchar(255) NOT NULL default '0',
  PRIMARY KEY  (`category_id`),
  KEY `parent_id` (`parent_id`),
  KEY `display_order` (`display_order`),
  KEY `what_fields_to_use` (`what_fields_to_use`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=339 ;

--
-- Дамп данных таблицы `auc13_geodesic_categories`
--

INSERT INTO `auc13_geodesic_categories` (`category_id`, `parent_id`, `category_name`, `description`, `display_order`, `category_image`, `category_count`, `auction_category_count`, `in_statement`, `what_fields_to_use`, `display_ad_description_where`, `display_all_of_description`, `length_of_description`, `use_buy_now`, `editable_bid_start_time_field`, `default_display_order_while_browsing_category`, `listing_types_allowed`, `display_storefront_link`, `use_auto_title`, `auto_title`) VALUES
(289, 234, 'Мебель', 'Мебель', 8, '', 14, 0, ' in (289)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(290, 234, 'Предметы коллекционирования', 'Предметы коллекционирования', 7, '', 19, 0, ' in (290)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(318, 310, 'Стекло, хрусталь', 'Стекло, хрусталь', 8, '', 0, 13, ' in (318)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(319, 310, 'Художественная  бронза, чугун, шпиатр и пр.', 'Художественная  бронза, чугун, шпиатр и пр.', 9, '', 0, 41, ' in (319)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(320, 310, 'Часы', 'Часы', 10, '', 0, 4, ' in (320)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(321, 310, 'Предметы интерьера', 'Предметы интерьера', 11, '', 0, 4, ' in (321)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(322, 310, 'Книги, разное', 'Книги, разное', 17, '', 0, 1, ' in (322)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(323, 310, 'Серебро', 'Серебро', 12, '', 0, 5, ' in (323)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(324, 310, 'Ювелирные изделия', 'Ювелирные изделия', 13, '', 0, 20, ' in (324)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(325, 310, 'Восточное искусство', 'Восточное искусство', 14, '', 0, 7, ' in (325)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(266, 234, 'Иконы и предметы религиозного культа', 'Иконы и предметы религиозного культа', 4, '', 50, 0, ' in (266)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(271, 248, 'Западноевропейская  живопись', 'Западноевропейская  живопись', 4, '', 0, 0, ' in (271)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(312, 310, 'Русская живопись', 'Русская живопись', 1, '', 0, 21, ' in (312)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(313, 310, 'Миниатюры', 'Миниатюры', 4, '', 0, 6, ' in (313)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(261, 234, 'Декоративно-прикладное искусство', 'Декоративно-прикладное искусство', 6, '', 135, 0, ' in (261)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(314, 310, 'Фарфор, керамика', 'Фарфор, керамика', 6, '', 0, 41, ' in (314)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(248, 0, 'Онлайн торги', 'Онлайн торги', 4, '', 0, 0, ' in (271,270,273,274,292,291,272,275,276,277,278,279,281,282,283,284,285,328,330,331,336,337,248)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(270, 248, 'Русская живопись', 'Русская живопись', 3, '', 0, 0, ' in (270)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(234, 0, 'Очные торги', 'Очные торги', 2, '', 517, 0, ' in (289,290,266,261,269,286,287,334,335,338,234)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(317, 310, 'Советская живопись', 'Советская живопись', 3, '', 0, 21, ' in (317)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(316, 310, 'Марки, открытки', 'Марки, открытки', 18, '', 0, 0, ' in (316)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(273, 248, 'Миниатюры', 'Миниатюры', 4, '', 0, 0, ' in (273)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(274, 248, 'Фарфор, керамика', 'Фарфор, керамика', 6, '', 0, 0, ' in (274)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(292, 248, 'Карты, гравюры, литографии', 'Карты, гравюры, литографии', 17, '', 0, 0, ' in (292)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(291, 248, 'Марки, открытки', 'Марки, открытки', 20, '', 0, 0, ' in (291)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(272, 248, 'Советская живопись', 'Советская живопись', 3, '', 0, 0, ' in (272)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(327, 310, 'Разное', 'Разное', 20, '', 0, 16, ' in (327)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(269, 234, 'Русская и западноевропейская живопись', 'Русская и западноевропейская живопись', 1, '', 95, 0, ' in (269)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(275, 248, 'Стекло, хрусталь', 'Стекло, хрусталь', 8, '', 0, 0, ' in (275)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(276, 248, 'Художественная  бронза, чугун, шпиатр и пр.', 'Художественная  бронза, чугун, шпиатр и пр.', 9, '', 0, 0, ' in (276)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(277, 248, 'Часы', 'Часы', 10, '', 0, 0, ' in (277)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(278, 248, 'Предметы интерьера', 'Предметы интерьера', 11, '', 0, 0, ' in (278)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(279, 248, 'Книги, разное', 'Книги, разное', 18, '', 0, 0, ' in (280,279)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(281, 248, 'Серебро', 'Серебро', 12, '', 0, 0, ' in (281)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(282, 248, 'Ювелирные изделия', 'Ювелирные изделия', 13, '', 0, 0, ' in (282)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(283, 248, 'Восточное искусство', 'Восточное искусство', 14, '', 0, 0, ' in (283)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(284, 248, 'Мебель', 'Мебель', 16, '', 0, 0, ' in (284)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(285, 248, 'Разное', 'Разное', 21, '', 0, 0, ' in (285)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(286, 234, 'Ювелирные изделия', 'Ювелирные изделия', 5, '', 27, 0, ' in (286)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(287, 234, 'Миниатюры и портреты', 'Миниатюры и портреты', 3, '', 55, 0, ' in (288,287)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(326, 310, 'Мебель', 'Мебель', 15, '', 0, 1, ' in (326)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(315, 310, 'Карты, гравюры, литографии', 'Карты, гравюры, литографии', 16, '', 0, 49, ' in (315)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(311, 310, 'Западноевропейская  живопись', 'Западноевропейская  живопись', 2, '', 0, 30, ' in (311)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(310, 0, 'Магазин', '', 1, '', 0, 336, ' in (318,319,320,321,322,323,324,325,312,313,314,317,316,327,326,315,311,329,332,333,310)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(328, 248, 'Иконы', 'Иконы', 5, '', 0, 0, ' in (328)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(329, 310, 'Иконы', 'Иконы', 5, '', 0, 14, ' in (329)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(330, 248, 'Ткани, прочее...', 'Ткани, прочее..', 20, '', 0, 0, ' in (330)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(331, 248, 'Фарфор,керамика после 1917 г.', 'Фарфор,керамика после 1917 г.', 7, '', 0, 0, ' in (331)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(332, 310, 'Ткани, прочее...', 'Ткани, прочее...', 19, '', 0, 5, ' in (332)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(333, 310, 'Фарфор,керамика после 1917 г.', 'Фарфор,керамика после 1917 г.', 7, '', 0, 37, ' in (333)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(334, 234, 'Букинистика', 'Букинистика', 9, '', 51, 0, ' in (334)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(335, 234, 'Графика', 'Графика', 2, '', 60, 0, ' in (335)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(338, 234, 'Антикварное оружие', 'Антикварное оружие', 10, '', 11, 0, ' in (338)', 'parent', 0, 0, 0, 0, 0, 0, 1, 0, 0, '0'),
(336, 248, 'Живопись', 'Живопись', 1, '', 0, 0, ' in (336)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0'),
(337, 248, 'Декоративно-прикладное искусство', 'Декоративно-прикладное искусство', 2, '', 0, 0, ' in (337)', 'parent', 0, 0, 0, 0, 0, 0, 2, 0, 0, '0');
