#
#<?php die('Forbidden.'); ?>
#Date: 2013-02-04 13:44:24 UTC
#Software: Joomla Platform 11.4.0 Stable [ Brian Kernighan ] 03-Jan-2012 00:00 GMT

#Fields: date	time	priority	clientip	category	message
2013-02-04	13:44:24	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:03:46	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:07:48	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:12:26	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:17:40	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:19:50	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:21:30	INFO	127.0.0.1	Joomla FAILURE: 	Пустой пароль не допускается
2013-02-04	17:41:06	INFO	127.0.0.1	Joomla FAILURE: 	Имя пользователя и пароль не совпадают или у вас еще нет учетной записи на сайте
2013-02-04	17:41:11	INFO	127.0.0.1	Joomla FAILURE: 	Имя пользователя и пароль не совпадают или у вас еще нет учетной записи на сайте
2013-02-04	17:42:28	INFO	127.0.0.1	Joomla FAILURE: 	Имя пользователя и пароль не совпадают или у вас еще нет учетной записи на сайте
2013-02-04	17:47:13	INFO	127.0.0.1	Joomla FAILURE: 	Имя пользователя и пароль не совпадают или у вас еще нет учетной записи на сайте
